<%@ Page Title="Junior Tester. FAQ. Какое программное обеспечение должен освоить тестер для работы?" Language="C#" MasterPageFile="~/FAQ/FAQ.master" AutoEventWireup="true" CodeFile="12.aspx.cs" Inherits="FAQ_12" %>

<asp:Content ID="Content1" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p class="name">FAQ (ЧаВо).</p>
	<p class="text"><H6>FAQ по тестированию программного обеспечения.</H6></p>
	<p class="text">12<a name="12"></a>. 
          <b>Какое программное обеспечение должен освоить тестер для работы (операционная 
          система, специальный софт, иное:)?</b></p>
      <blockquote> 
	<p class="text">Павел Гущин:</p>
        <blockquote> 
	<p class="text">Человек (тестер) 
              не может знать и уметь все. Он должен уметь быстро учиться. Разные 
              компании имеют разный софт и системы. Необходимо уметь не бояться 
              нового. Философия. А в принципе В. Ульянов говорил: "Учиться, учиться 
              ...." и был прав.</p>
        </blockquote>
	<p class="text"><a href="mailto:info@portnov.com">Михаил 
            Портнов</a>:</p>
        <blockquote> 
	<p class="text">По ситуации. 
              Нет общих рекомендаций</p>
        </blockquote>
	<p class="text"><a href="mailto:s-test@mail.ru">Прим. 
            редактора</a>.</p>
        <blockquote> 
	<p class="text">Классически 
              предполагается, что тестеру в работе могут понадобится следующее 
              программы: операционная система под которой предполагается проводить 
              тестирование (иногда интересы дела требуют установки двух и более 
              систем на одну машину), пакет Microsoft Office или аналогичный (в 
              частности Microsoft Word, Excess или на крайний случай Блокнот), 
              утилиты для записи снятия снимков с экрана, утилиты и устройства 
              для записи видео на пленку и/или непосредственно на винчестер, системы 
              для трекинга багов (базы данных), конверторы для различных типов 
              файлов, утилиты для сравнения структуры двух файлов и каталогов, 
              процессор планов, а так же специальный софт для автоматизации процесса 
              тестирования. Более подробно можно почитать об этом в книге Сэм 
              Канер, Джек Фолк, Енг Кек Нгуен <b>"Тестирование программного обеспечения"</b>. 
              </p>
        </blockquote>
	</blockquote>
	<br />

</asp:Content>

