<%@ Page Title="Junior Tester. FAQ. Кто отвечает за качество ПО - тестер или разработчик?" Language="C#" MasterPageFile="~/FAQ/FAQ.master" AutoEventWireup="true" CodeFile="16.aspx.cs" Inherits="FAQ_16" %>

<asp:Content ID="Content1" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">

        <p class="text"><H6>FAQ по тестированию программного обеспечения.</H6></p>
        <p class="text">16<a name="16"></a>. 
          <b>Кто отвечает за качество ПО - тестер или разработчик?</b></p>
      <blockquote> 
        <p class="text">Павел Гущин:</p>
        <blockquote> 
        <p class="text">"Сядим усе!" 
              :) </p>
        <p class="text">По классике 
              тестерский отдел - та инстанция, которая говорит да или нет. Но 
              качество тестирования не всегда зависит только от тестеров. Очень 
              многое зависит от людей, которые готовили тех. задание, например. 
              От тех, кто готовил или ставил задачу. От того, какие были критерии. 
              Сколько времени было отведено для тестирования. На сколько хорошо 
              подготовлена лаборатория. Какое там оборудование. И еще момент. 
              Программист и тестер должны работать сообща, помогая друг другу. 
              Если программер смотрит на тестера как на человека создающего проблемы, 
              то ничего хорошего не получится. </p>
        </blockquote>
        <p class="text"><a href="mailto:info@portnov.com">Михаил 
            Портнов</a>:</p>
        <blockquote> 
        <p class="text">Перед тем, 
              кто платит деньги, в ответе вся фирма в целом. Никто не разбирается 
              что за структура внутри. Перед инвесторами и акционерами компании 
              в ответе руководство компании. Перед руководством компании в ответе 
              те, кто попадется под руку, а точнее, каждый по своему виноват. 
              Надо понимать, что всех ошибок не отловить. Более того, даже известные 
              ошибки нельзя все починить - нет времени. ПО уходит к потребителю 
              с большим количеством известных багов и Бог знает с каким количеством 
              неизвестных. Но, плохая работа тестера может стать явной просто 
              в силу характера проблемы, обнаруженной портебителем. Есть вещи, 
              которые тестер не имеет права пропускать. То же самое и с программистом. 
              Вывод: обычно серьезная проблема имеет место как результат плохой 
              работы сразу нескольких звеньев. Каждое виновато по-своему.</p>
        </blockquote>
      </blockquote>
	<br />
</asp:Content>

