<%@ Page Title="Junior Tester. FAQ. Какие модели жизненного цикла разработки существуют?" Language="C#" MasterPageFile="~/FAQ/FAQ.master" AutoEventWireup="true" CodeFile="19.aspx.cs" Inherits="FAQ_19" %>

<asp:Content ID="Content1" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p class="name">FAQ (ЧаВо).</p>
	<p class="text"><H6>FAQ по тестированию программного обеспечения.</H6></p>
	<p class="text">19<a name="19"></a>. 
          <b>Какие модели жизненного цикла разработки существуют?</b></p>
      <blockquote> 
	<p class="text">Павел Гущин:</p>
        <blockquote> 
	<p class="text">Есть краткосрочные 
              проекты, 6-12 месяцев. Есть долгосрочные. Для каждой из этих моделей 
              существуют свои стратегии и тактики. Детально сказать не берусь. 
              Глубоко этот вопрос не прорабатывал. Для краткосрочных проектов, 
              обычно начинают писать код практически сразу, без детальной проработки. 
              Соответственно тестинг начинается с этапа, когда первые элементы 
              системы готовы. В этом есть и плюсы и минусы. Все зависит от профессионального 
              уровня тестеров и программистов. А также от бюджета. Больше денег 
              - можно нанять более дорогих специалистов.</p>
        </blockquote>
      </blockquote>
	<br />
</asp:Content>

