<%@ Page Language="C#" MasterPageFile="~/FAQ/FAQ.master" AutoEventWireup="true" CodeFile="2.aspx.cs" Inherits="FAQ_2" Title="Junior Tester. FAQ. Кто такие тестер и бета-тестер? Синонимы понятий..." %>

<asp:Content ID="Content1" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p class="name">FAQ (ЧаВо).</p>
	<p class="text"><H6>FAQ по тестированию программного обеспечения.</H6></p>
	<p class="text">2<a name="2"></a>. 
          <b>Кто такие тестер и бета-тестер? Синонимы понятий...</b></p>
      <blockquote> 
	<p class="text">Павел Гущин:</p>
        <blockquote> 
	<p class="text">Бета-тестер 
            - исключительно русский аналог используемого в США и Канаде просто 
            - тестер (tester, Quality Assurance Analyst, QA Specialist, QA Engineer). 
            Все эти названия специальностей обозначают одно и тоже, только квалификация 
            может быть разная. Есть еще одно различия в этом понятии. Бета тестер 
            - это как правило "конечный пользователь" программного продукта, который 
            первым имеет возможность его "пощупать". Как правило бета-тестер не 
            получает вознаграждения за свой труд, точнее "платой" за труд в данном 
            случае является бесплатное использование версий продукта и/или приобретение 
            его со скидками. Тестер же - это профессия, как правило хорошо оплачиваемая, 
            хотя и менее квалифицированная, чем программист. Тестер обеспечивает 
            качество продукта начиная уже с самых ранних этапов его разработки.</p>
        </blockquote>
	<p class="text"><a href="mailto:info@portnov.com">Михаил 
            Портнов</a>:</p>
        <blockquote> 
	<p class="text">Тестер 
            - это человек, профессионально занимающийся поиском ошибок в программном 
            обеспечении. Бета-тестер, наоборот, является пользователем программного 
            продукта, способным увидеть в нем ошибки именно в силу того, что им 
            пользуется. Тестер владеет технологией и инструментарием тестирования, 
            профессией. Он имеет специальные знания и навыки. Бета-тестер не владеет 
            технологией тестирования. Он находит ошибки не потому, что знает как 
            это надо делать, а наталкивается на них, пользуясь сырым программным 
            продуктом. Бета-тестер привлекается компанией на этапе БЕТА разработки 
            софтвера, непосредственно перед выходом программного продукта к потребителю.</p>
        </blockquote>
      </blockquote>
	<br />
</asp:Content>

