<%@ Page Language="C#" MasterPageFile="~/JuniorTester.master" AutoEventWireup="true" CodeFile="Intro.aspx.cs" Inherits="Intro" Title="Junior Tester. Введение." %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
<meta name="description" content="Введение в тестирование программ. Тестинг." />
<meta name="keywords" content="тестирование, тест, бета-тестирование, програмное обеспечение, программы, тестер, бета-тестер, тестинг,софт,software test, бесплатно, начинающему бетатестеру, документация, стандарты, литература, ссылки, ресурсы для тестера" />
</asp:Content>

<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p><H2>Привет всем!</H2></p>
      <p class="text">Первая версия этого сайта была разработана мной в далеком 2001 как попытка систематизировать собственные 
          знания. В то время информации на русском по теме тестирования ПО было крайне мало, а англоязычная литература была 
          труднодоступна. Сейчас, через призму новых знаний, навыков и опыта многое, что тут написано, кажется наивным, 
          а большая часть требует полной или частичной переработки. Но тем не менее, базовые вопросы тестирования, 
          изложенные здесь, на мой взгляд все еще актуальны. Собственно, это одна из главных причин, по которой было принято 
          решение возродить проект. Да и хочется вновь пересмотреть уже накопленное :)</p>
      <p class="text">Сайт длительное время кочевал с места на место пока окончательно не обосновался на nadrod.ru. 
          Данный сайт - это урезанный вариант старого доброго s-test.narod.ru. Убран целый ряд разделов, которые, 
          по моему мнению, нуждаются в переработке. Оставлены те разделы, которые, на мой взгляд, все еще могут принести пользу
          начинающему тестировщику ПО.</p>
      <p class="text">Хотелось бы выразить огромную благодарность всем тем кто не раз уже помог мне в создании сайта, 
потратив на это и свои силы, и свое время.
Прежде всего, замечательному тестировщику с многолетним стажем Павлу Гущину, благодаря которому сайт 
обзавелся не только хорошим зеркалом, но и FAQ'ом. Директору школы тестировщиков в Силиконовой долине
Михаилу Портнову, за его внимание к ресурсу, ценные советы и корректировку.
Yuri Roy за его ценные статьи для сайта.
А так же моим самым дорогим в мире людям - жене и сыну, за их понимание, и за то, 
что им, часа в 2-3 ночи все же удается оттащить меня от компьютера и уложить спать. :-)</p>
      <p class="text">Ну а теперь немного официоза...</p>
      <p class="text">Хотелось бы обратить 
        Ваше внимание на следующие моменты:</p>
      <p class="text">1. Автор(ы) сайта не 
        несут ответственности за возможные последствия использования опубликованных 
        здесь материалов.</p>
      <p class="text">2. Все статьи не 
        являются догмой и доступны для обсуждения. Я бы даже сказал, что обсуждение любой статьи очень даже приветствуется. 
	И, если у тебя, мой Читатель, есть свое мнение по поднятой проблеме - не стесняйся и пиши. Я с удовольствием размещу 
	твою статью на сайте, даже если она будет состоять из одного абзаца...</p>
      <p class="text">3. Ресурс не является 
        коммерческим и полностью бесплатен. Т.е. все материалы могут использоваться 
        читателем как freeware с сохранением ссылки на первоисточник и копирайтов. 
        Все материалы публикуются бесплатно. Все права сохраняются за авторами 
        статей. Мы не несем ответственности за коммерческое использование материалов, 
        размещенных на сайте.</p>
      <p class="text">4. В случае обнаружения 
        вебмастером или компетентными лицами информации нарушающей законодательство 
        соответствующий материал будет немедленно удален без предварительного 
        уведомления.</p>
      <p class="text">5. Все используемые 
        названия могут являться торговыми марками и принадлежать их владельцам.</p> 
      <p class="text">И на последок, хотелось бы выразить надежду, что сайт будет полезен не только начинающим, но и уже более опытным 
	тестировщикам. Давайте создавать его вместе!
	Связаться со мной по любому вопросу связанному с данным сайтом можно, написав по адресу <a href="mailto:s-test@mail.ru">s-test@mail.ru</a>.</p>
    <br/>
</asp:Content>

