<%@ Page Title="Junior Tester. Конспект. Документация. Документооборот..." Language="C#" MasterPageFile="~/Theory/Docs/TheoryDocs.master" AutoEventWireup="true" CodeFile="Oborot.aspx.cs" Inherits="Theory_Docs_Oborot" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
    <meta name="description" content="Документация для тестера. Документооборот." />
    <meta name="keywords" content="документооборот, определение понятия, тестирование, тест, бета-тестирование, програмное обеспечение, программы, тестер, бета-тестер, тестинг,софт,software test, бесплатно, начинающему бетатестеру, документация, стандарты, литература, ссылки, ресурсы для бета-тестера" />
</asp:Content>

<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
       <p class="name">Документооборот.</p>
      <p class="text">Под документооборотом 
        мы понимаем процесс обмена документацией как между членами одной команды 
        между собой, так и между командами в целом.</p>
      <p class="text">В данном процессе 
        обязательно должно присутствовать три звена:</p>
      <ol class="decimal">
        <li>Документ, доступный для обмена.</li>
        <li>Способ обмена (средства связи).</li>
        <li>Ответственный или ответственные за процесс его своевременного распространения.</li>
      </ol>
      <p class="text">Варианты могут быть 
        самыми разнообразными в зависимости от численности команды, сложности 
        проекта, финансовых вложений и т.п. Вы можете использовать e-mail, факс, 
        локальную сеть, удаленный доступ к сети головного офиса и т.д. Главным 
        условием является своевременность получения сотрудниками необходимой документации.</p>
	<br />
</asp:Content>

