<%@ Page Title="Junior Tester. Конспект. Литература. Введение..." Language="C#" MasterPageFile="~/Theory/Literature/TheoryLiterature.master" AutoEventWireup="true" CodeFile="Intro.aspx.cs" Inherits="Theory_Literature_Intro" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
    <meta name="description" content="Введение в тестирование программ. Книги, литература, учебники." />
    <meta name="keywords" content="Книги, литература, учебники, тестирование, тест, бета-тестирование, програмное обеспечение, программы, тестер, бета-тестер, тестинг,софт,software test, бесплатно, начинающему бетатестеру, документация, стандарты, литература, ссылки, ресурсы для бета-тестера" />
</asp:Content>

<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p><H4>Введение.</H4></p>
      <p class="text">Данный раздел 
          предназначен главным образом для тех, кто безуспешно (или наоборот) 
          ищет печатные или электронные литературные источники, посвященные проблемам 
          тестирования. К сожалению, на сегодняшний день книги по тестированию 
          в основном не доступны: русскоязычные - из-за их отсутствия; англоязычные 
          - из-за дороговизны оригиналов и отсутствия переводных изданий. Все 
          же мы постараемся пополнять подборку по мере наших сил и возможностей. 
          Если же кто-нибудь из авторов пожелает безвозмездно предоставить свой 
          труд для всеобщего скачивания, мы с удовольствием разместим его произведение 
          на нашем сервере. Для удобства навигации источники разделены на англо- 
          и русскоязычные.</p>
	<br />
</asp:Content>

