<%@ Page Title="Junior Tester. Конспект. Литература. Русскоязычная..." Language="C#" MasterPageFile="~/Theory/Literature/TheoryLiterature.master" AutoEventWireup="true" CodeFile="Rus.aspx.cs" Inherits="Theory_Literature_Rus" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
    <meta name="description" content="Введение в тестирование программ. Книги, литература, учебники." />
    <meta name="keywords" content="Книги, литература, учебники, на русском языке, тестирование, тест, бета-тестирование, програмное обеспечение, программы, тестер, бета-тестер, тестинг,софт,software test, бесплатно, начинающему бетатестеру, документация, стандарты, литература, ссылки, ресурсы для бета-тестера" />
</asp:Content>

<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p><H4>Русскоязычные печатные источники:</H4></p>
      <ol class="decimal">
        <li><a name=kaner></a>Сэм Канер, Джек Фолк, Енг Кек Нгуен. "Тестирование программного обеспечения". Издательство DiaSoft. ISBN 966-7393-42-9 (рус.) ISBN 1-85032-847-1 (англ.).</li>
        <li><a name=kalb></a>Роберт Калбертсон, Крис Браун, Гэри Кобб. "Быстрое тестирование". Издательский дом "Вильямс". ISBN 5-8459-0336-Х (рус.) ISBN 0-13-091294-8 (англ.).</li>
        <li>В.В. Липаев "Требования 
          к структуре и содержанию документации на прикладные программные средства 
          информационных систем". Методическое руководство, М.:, МГТУ "Станкин", 
          1999. - 77с., ил.</li>
        <li>В.В. Липаев "Тестирование 
          программных средств". Методическое руководство, М.: МГТУ "Станкин", 
          1999. - 118c., ил.</li>
        <li>В.В. Липаев "Сертификация 
          систем качества на соответствие стандартам серии ISO 9000 для предприятий-разработчиков 
          программных средств". Методическое руководство, М.: МГТУ "Станкин", 
          2000. - 132 с.</li>
        <li>В.В. Липаев "Системное 
          проектирование сложных программных средств для информационных систем" 
          М.: СИНТЕГ, 1999, 224 с. (В рамках Серии "Информатизация России на пороге 
          ХХI века").</li>
      </ol>
	<br />
</asp:Content>

