<%@ Page Title="Junior Tester. Конспект. ЖЦРПО. RAD..." Language="C#" MasterPageFile="~/Theory/LC/TheoryLC.master" AutoEventWireup="true" CodeFile="Rad.aspx.cs" Inherits="Theory_LC_Rad" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
    <meta name="description" content="Жизненный цикл разработки програмного обеспечения." />
    <meta name="keywords" content="RAD, жизненный цикл, ЖЦРПО, тестирование, тест, бета-тестирование, програмное обеспечение, программы, тестер, бета-тестер, тестинг,софт,software test, бесплатно, начинающему бетатестеру, документация, стандарты, литература, ссылки, ресурсы для бета-тестера" />
</asp:Content>

<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
      <p class="name">RAD (Rapid Application Development).</p>
        <p class="text">RAD или быстрая 
          разработка приложений представляет собой спиральную модель жизненного 
          цикла разработки ПО. Сущность ее заключается в разработке программы 
          в максимально сжатые сроки (не более 6 мес.) и минимально малой командой 
          разработчиков (до 10 человек). При этом требования к разрабатываемому 
          ПО выясняются по ходу разработки. А сам процесс кодирования начинается 
          уже с определения общих ключевых моментов будущей функциональности программы 
          и корректируется по ходу поступления от заказчика новой информации. 
          Цикл включает в себя практически все основные этапы разработки. Особенностью 
          тестирования при использовании данной методики является начало его на 
          максимально ранних сроках разработки, с привлечением бета-тестера уже 
          к модульному тестированию, использование CASE-средств. Более подробную 
          информацию можно получить из статьи "CASE-технологии, Современные методы 
          и средства проектирования информационных систем", А.М.Вендров, <a href="http://www.citforum.ru/database/case/glava1_3_2.shtml" target="_blank">Методология 
          RAD</a>, 1997, размещенной на сервере <a href="http://www.citforum.ru/" target="_blank">Citforum</a> 
          (Методология RAD).</p>
	<br />
</asp:Content>

