<%@ Page Title="Junior Tester. Конспект. Тестинг. Рабочее место..." Language="C#" MasterPageFile="~/Theory/Testing/TheoryTesting.master" AutoEventWireup="true" CodeFile="Workplace.aspx.cs" Inherits="Theory_Testing_Workplace" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
    <meta name="description" content="Бета-тестинг. Организация рабочего дня и рабочего места." />
    <meta name="keywords" content="рабочее место бет-тестера, аппаратура, требования, тестирование, тест, бета-тестирование, програмное обеспечение, программы, тестер, бета-тестер, тестинг,софт,software test, бесплатно, начинающему бетатестеру, документация, стандарты, ссылки, ресурсы для бета-тестера" />
</asp:Content>

<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolderText" Runat="Server">
        <p><H4>Рабочее место.</H4></p>
        <p class="text">Выбор места и условий 
          работы важен не только для тестера, но и для любого специалиста. Безусловно, 
          такой выбор доступен не каждому. Далеко не все могут выбирать где именно 
          ему работать - дома или в офисе; у окна или двери; за специальным столом 
          или за обычным письменным и т.д. Но если такой выбор у Вас есть, то 
          его лучше сделать правильно. Мы дадим лишь некоторые, важные, на наш 
          взгляд, рекомендации:</p>
        <ul class="disc">
          <li>Выбирайте рабочее 
            место там, где Вы сможете полностью сосредоточиться. Если это отдельная 
            комната, которую Вы можете оборудовать под кабинет дома - прекрасно, 
            если же нет - лучше перебраться в офис или, если позволяет заработная 
            плата, снять отдельное помещение.</li>
          <li>Обеспечьте 
            себя средствами связи. В идеале - отдельный телефонный номер для голоса, 
            отдельный для модема.</li>
          <li>Выбирайте мебель 
            соответственно имеющейся у Вас площади, Вашему росту и комплекции. 
            Прежде чем заплатить - просто присядьте. Удобно? Сможете Вы так отработать 
            12-15 часов подряд?</li>
          <li>Старайтесь 
            выбрать стол с выдвижной доской для клавиатуры. Это не только сэкономит 
            Вам место на столе, но и позволит Вам отодвинуться дальше от монитора.</li>
          <li>Стул должен 
            быть крутящимся, с регулировкой по высоте и обязательно с подлокотниками. 
            Это не роскошь! Подлокотники позволят обеспечить оптимальное положение 
            Вашим рукам.</li>
          <li>Приобретите 
            очки для работы за компьютером (НЕ 3-D! :)). Специальное покрытие 
            не только защитит глаза, но и поможет избежать ежедневной головной 
            боли.</li>
          <li>Используйте 
            мониторы с диагональю экрана не менее 15". Обратите внимание на соответствие 
            всем техническим стандартам. · Пользуйтесь эргономичной клавиатурой. 
            Обратите внимание на то, что клавиатура должна иметь не пластиковое, 
            а металлическое дно.</li>
          <li>Приобретайте 
            комплектующие из списка совместимости к той операционной системе, 
            в которой Вам предстоит работать. Отдавайте предпочтение брендам. 
            </li>
          <li>Используйте только лицензионный софт!</li>
          <li>Обратите так 
            же Ваше внимание на те санитарно-гигиенические требования, которые 
            предъявляются к рабочему месту и аппаратуре для людей проводящих весь 
            свой рабочий день за компьютером.</li>
        </ul>
        <p class="text">Более подробную 
          информацию можно получить из статьи Ольги Макаровой <a href="http://www.infocity.kiev.ua/other/content/bbwwipc.phtml" target="_blank">"Друг! 
          При работе с ПК бдителен будь" (Еженедельник "Computerworld Россия")</a>, 
          опубликованной на сервере <a href="http://www.infocity.kiev.ua" target="_blank">InfoCity</a>. 
        </p>
        <br />
</asp:Content>

